tests/cassettes/TestUpcoming.test_build.yaml

interactions:
- request:
    body: null
    headers:
      Accept: ['*/*']
      Accept-Encoding: ['gzip, deflate']
      Connection: [keep-alive]
      Stripe-Version: ['2018-05-21']
      User-Agent: ['Stripe/v1 PythonBindings/1.84.1 django-rayures/v0.4a20+0.g3bde791.dirty
          (https://lab.errorist.xyz/django/rayures)']
      X-Stripe-Client-User-Agent: ['{"bindings_version": "1.84.1", "lang": "python",
          "publisher": "stripe", "httplib": "requests", "lang_version": "3.7.0", "platform":
          "Darwin-17.6.0-x86_64-i386-64bit", "uname": "Darwin mutiny.local 17.6.0
          Darwin Kernel Version 17.6.0: Tue May  8 15:22:16 PDT 2018; root:xnu-4570.61.1~1/RELEASE_X86_64
          x86_64 i386", "application": {"name": "django-rayures", "partner_id": null,
          "url": "https://lab.errorist.xyz/django/rayures", "version": "v0.4a20+0.g3bde791.dirty"}}']
      authorization: [DUMMY]
    method: GET
    uri: https://api.stripe.com/v1/invoices/upcoming?customer=cus_BRObI5Us8hKBoq
  response:
    body: {string: "{\n  \"object\": \"invoice\",\n  \"amount_due\": 9999,\n  \"amount_paid\"\
        : 0,\n  \"amount_remaining\": 9999,\n  \"application_fee\": null,\n  \"attempt_count\"\
        : 0,\n  \"attempted\": false,\n  \"billing\": \"charge_automatically\",\n\
        \  \"billing_reason\": \"upcoming\",\n  \"charge\": null,\n  \"closed\": false,\n\
        \  \"currency\": \"usd\",\n  \"customer\": \"cus_BRObI5Us8hKBoq\",\n  \"date\"\
        : 1532184904,\n  \"description\": null,\n  \"discount\": null,\n  \"due_date\"\
        : null,\n  \"ending_balance\": null,\n  \"forgiven\": false,\n  \"lines\"\
        : {\n    \"object\": \"list\",\n    \"data\": [\n      {\n        \"id\":\
        \ \"sli_af0e07feb35134\",\n        \"object\": \"line_item\",\n        \"\
        amount\": 9999,\n        \"currency\": \"usd\",\n        \"description\":\
        \ \"1 \xD7 Plan 1 Test (at $99.99 / month)\",\n        \"discountable\": true,\n\
        \        \"livemode\": false,\n        \"metadata\": {},\n        \"period\"\
        : {\n          \"end\": 1534863304,\n          \"start\": 1532184904\n   \
        \     },\n        \"plan\": {\n          \"id\": \"PLAN-1-TEST\",\n      \
        \    \"object\": \"plan\",\n          \"active\": true,\n          \"aggregate_usage\"\
        : null,\n          \"amount\": 9999,\n          \"billing_scheme\": \"per_unit\"\
        ,\n          \"created\": 1501314263,\n          \"currency\": \"usd\",\n\
        \          \"interval\": \"month\",\n          \"interval_count\": 1,\n  \
        \        \"livemode\": false,\n          \"metadata\": {\n            \"coupon\"\
        : \"VOUCH-50-USD\"\n          },\n          \"nickname\": null,\n        \
        \  \"product\": \"prod_BUMXJWClxAISXj\",\n          \"tiers\": null,\n   \
        \       \"tiers_mode\": null,\n          \"transform_usage\": null,\n    \
        \      \"trial_period_days\": null,\n          \"usage_type\": \"licensed\"\
        \n        },\n        \"proration\": false,\n        \"quantity\": 1,\n  \
        \      \"subscription\": \"sub_BROsof61nYTM7D\",\n        \"subscription_item\"\
        : \"si_1B4W4yKf0MzeZZE3yweCHiPo\",\n        \"type\": \"subscription\"\n \
        \     }\n    ],\n    \"has_more\": false,\n    \"total_count\": 1,\n    \"\
        url\": \"/v1/invoices/upcoming/lines?customer=cus_BRObI5Us8hKBoq\"\n  },\n\
        \  \"livemode\": false,\n  \"metadata\": {},\n  \"next_payment_attempt\":\
        \ 1532188504,\n  \"number\": \"1F31E75-0095\",\n  \"paid\": false,\n  \"period_end\"\
        : 1532184904,\n  \"period_start\": 1529592904,\n  \"receipt_number\": null,\n\
        \  \"starting_balance\": 0,\n  \"statement_descriptor\": null,\n  \"subscription\"\
        : \"sub_BROsof61nYTM7D\",\n  \"subtotal\": 9999,\n  \"tax\": null,\n  \"tax_percent\"\
        : null,\n  \"total\": 9999,\n  \"webhooks_delivered_at\": null\n}\n"}
    headers:
      Access-Control-Allow-Credentials: ['true']
      Access-Control-Allow-Methods: ['GET, POST, HEAD, OPTIONS, DELETE']
      Access-Control-Allow-Origin: ['*']
      Access-Control-Expose-Headers: ['Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required,
          X-Stripe-Privileged-Session-Required']
      Access-Control-Max-Age: ['300']
      Cache-Control: ['no-cache, no-store']
      Connection: [keep-alive]
      Content-Length: ['2280']
      Content-Type: [application/json]
      Date: ['Thu, 19 Jul 2018 13:15:25 GMT']
      Request-Id: [req_5PEFTNrXdhvY4p]
      Server: [nginx]
      Strict-Transport-Security: [max-age=31556926; includeSubDomains; preload]
      Stripe-Version: ['2018-05-21']
    status: {code: 200, message: OK}
version: 1
